# CLI Tools
brew "git"
# Note: Node is managed by nvm via Herd (not Homebrew)
brew "python@3.12"
brew "wget"
brew "curl"
brew "vim"
brew "tree"
brew "htop"
brew "jq"
brew "fzf"
brew "urlview"  # Required for tmux-urlview plugin

# Development Tools
brew "gh"  # GitHub CLI
brew "uv"  # Python package manager
brew "opencode"  # AI coding agent
cask "1password-cli"  # 1Password CLI

# Applications
cask "spotify"
cask "cursor"
cask "raycast"
cask "orbstack"
cask "linear-linear"

# Fonts
cask "font-fira-code"
cask "font-hasklig"
